abdul-basit-shaikh/CH32V003F4P6_tank_sensor/User/main.c
    if (attempt < DATA_MAX_RETRIES - 1) {
      uint32_t retry_jitter_ms =
          DATA_RETRY_DELAY_MS + ((millis() + attempt) & 0x1F) * 2;
      tx_wait_result_t retry_result = service_runtime_window(
          runtime, retry_jitter_ms, false, attempt, runtime->seq_num);
      if (retry_result == TX_WAIT_ABORTED) {
        radio_power_down();
        return TX_SEND_ABORTED;
      }
    }
  }

  radio_power_down();
  return TX_SEND_NO_ACK;
}

static void send_instant_force_update(runtime_state_t *runtime) {
  DEBUG_PRINT("[SYS] Single Click -> Force Instant Send\r\n");

  // 1 Fast Blink Acknowledgement
  GPIO_ResetBits(GPIOD, LED_PIN);
  Delay_Ms(50);
  GPIO_SetBits(GPIOD, LED_PIN);

  if (g_settings.pairing_status != 1) {
    DEBUG_PRINT("[SYS] Not Paired -> Run Pairing\r\n");
    return;
  }

  uint8_t current_level = read_tank_level();
  runtime->filtered_level = current_level;
  runtime->last_sent_level = current_level;
  runtime->sleep_cycle_count = 0;
  read_battery_level();

  uint8_t packet[32];
  prepare_data_packet(packet, current_level);
  tx_send_result_t res = send_data_with_retry(runtime, packet);
  if (res == TX_SEND_ACKED) {
    runtime->seq_num++;
    DEBUG_PRINT("[DATA] Force Send -> ACK OK\r\n");
  } else {
    DEBUG_PRINT("[DATA] Force Send -> No ACK\r\n");
  }
}

/* ========== TIM2 for millis (1ms) ========== */
void TIM2_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void TIM2_IRQHandler(void) {
  if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET) {
    g_millis++;
    TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
  }
}

void timer_init(void) {
  TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure = {0};
  NVIC_InitTypeDef NVIC_InitStructure = {0};
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

  // Period 9 and Prescaler for 1ms interrupt
  TIM_TimeBaseStructure.TIM_Period = 9;
  TIM_TimeBaseStructure.TIM_Prescaler = (SystemCoreClock / 10000) - 1;
  TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);

  TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
  NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  TIM_Cmd(TIM2, ENABLE);
}

uint32_t millis(void) { return g_millis; }

/* ========== GPIO Init ========== */
void gpio_init(void) {
  GPIO_InitTypeDef GPIO_InitStructure = {0};
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOA, ENABLE);

  // Button: PD6 (Input Pull-up)
  GPIO_InitStructure.GPIO_Pin = BUTTON_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(GPIOD, &GPIO_InitStructure);

  // LED: PD2 (Output Push-pull)
  GPIO_InitStructure.GPIO_Pin = LED_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOD, &GPIO_InitStructure);

  GPIO_SetBits(GPIOD, LED_PIN); // Turn off at start (Active-Low)

  // Sensor Common Power: PD3 (Output Push-pull, initially 0V / OFF)
  GPIO_InitStructure.GPIO_Pin = SENSOR_POWER_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
  GPIO_ResetBits(GPIOD, SENSOR_POWER_PIN); // Keep OFF during sleep

  // Sensor Pins: PC0, PC1, PC2, PC4 (Input Pull-up)
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
  GPIO_InitStructure.GPIO_Pin =
      SENSOR_PIN_25 | SENSOR_PIN_50 | SENSOR_PIN_75 | SENSOR_PIN_100;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

  // Initialize EXTI for these pins
  exti_init();
}

/**
 * @brief Reads all tank probes and applies software patches for hardware
 * reliability and fault monitoring.
 *
 * LOGIC EXPLANATION (Hardware Patch):
 * In a standard water tank, if a higher probe (e.g., 50%) is touching water,
 * all probes below it (e.g., 25%) MUST also be touching water.
 * If a lower probe wire is broken or the probe is oxidized, it might
 * report "Dry" even when the tank is half full.
 *
 * This function handles two critical tasks:
 * 1. PROBE FAULT DETECTION: It checks if there's a "gap" in readings (e.g.,
 *    100% is wet but 25% is dry). If a gap is found, it sets g_probe_fault=1
 *    to alert the user about possible broken wires or dirty sensors.
 *
 * 2. BROKEN WIRE FIX: Even if a lower probe is faulty, the function
 *    automatically fills in the gap in software to ensure the displayed
 *    water level remains accurate.
 *
 * Benefit: Prevents "jumpy" or incorrect readings and provides a "Service
 * Required" alert if hardware maintenance is needed.
 */
uint8_t read_internal_probes(uint8_t *fault_out) {
  // 1. Power ON the common probe wire (PD3)
  GPIO_SetBits(GPIOD, SENSOR_POWER_PIN);
  Delay_Ms(PROBE_SETTLE_DELAY_MS); // 10ms robust stabilization for long tank wires & low-TDS water

  // 2. Take multi-samples to filter contact resistance & AC ripple (2ms multi-sample)
  uint8_t c25 = 0, c50 = 0, c75 = 0, c100 = 0;
  for (int s = 0; s < PROBE_SAMPLE_COUNT; s++) {
    if (GPIO_ReadInputDataBit(GPIOC, SENSOR_PIN_25) == 0)
      c25++;
    if (GPIO_ReadInputDataBit(GPIOC, SENSOR_PIN_50) == 0)
      c50++;
    if (GPIO_ReadInputDataBit(GPIOC, SENSOR_PIN_75) == 0)
      c75++;
    if (GPIO_ReadInputDataBit(GPIOC, SENSOR_PIN_100) == 0)
      c100++;
    Delay_Ms(2);
  }

  // 3. Power OFF probe wire immediately (keeps average power < 0.01mW)
  GPIO_ResetBits(GPIOD, SENSOR_POWER_PIN);
  Delay_Ms(1); // Settle & drain residual wire capacitance

  // Majority vote: >= PROBE_MAJORITY_VOTE out of PROBE_SAMPLE_COUNT (e.g. >= 3 out of 5)
  uint8_t p25 = (c25 >= PROBE_MAJORITY_VOTE);
  uint8_t p50 = (c50 >= PROBE_MAJORITY_VOTE);
  uint8_t p75 = (c75 >= PROBE_MAJORITY_VOTE);
  uint8_t p100 = (c100 >= PROBE_MAJORITY_VOTE);

  DEBUG_PRINT("[PROBES] Raw hits (out of %d): [25%%]:%d [50%%]:%d [75%%]:%d [100%%]:%d\r\n",
              PROBE_SAMPLE_COUNT, c25, c50, c75, c100);

  // --- FAULT DETECTION LOGIC: Bitmask Mode ---
  uint8_t fault_mask = 0;
  if (p100) {
    if (!p75)
      fault_mask |= (1 << 2);
    if (!p50)
      fault_mask |= (1 << 1);
    if (!p25)
      fault_mask |= (1 << 0);
  } else if (p75) {
    if (!p50)
      fault_mask |= (1 << 1);
    if (!p25)
      fault_mask |= (1 << 0);
  } else if (p50) {
    if (!p25)
      fault_mask |= (1 << 0);
  }

  if (fault_out)
    *fault_out = fault_mask;

