abdul-basit-shaikh/CH32V003F4P6_tank_sensor/User/main.c
void run_pairing(void) {
  radio_init();
  Delay_Ms(100);

  uint16_t new_id = generate_new_tank_id();
  DEBUG_PRINT("\r\n[PAIR] NewID:0x%04X\r\n", new_id);

  // DO NOT save pairing_status yet - wait for controller ACK first
  uint8_t packet[32] = {0};
  packet[0] = 0xAA;
  packet[1] = 0x55;
  packet[2] = 0x01; // PKT_TYPE_PAIRING_REQ
  packet[3] = 32;
  packet[4] = (new_id & 0xFF);
  packet[5] = (new_id >> 8);
  packet[6] = read_tank_level(); // Level at index 6
  DEBUG_PRINT("[PAIR] Lvl:%d Reading bat...\r\n", packet[6]);
  packet[7] = read_battery_level(); // Battery at index 7
  DEBUG_PRINT("[PAIR] Bat:%d\r\n", packet[7]);
  packet[8] = 0x10; // Version at index 8
  packet[31] = calculate_checksum(packet, 32);

  DEBUG_PRINT("[PAIR] Pkt: ");
  for (int k = 0; k < 8; k++)
    DEBUG_PRINT("%02X ", packet[k]);
  DEBUG_PRINT("CRC:%02X\r\n", packet[31]);

  DEBUG_PRINT("[PAIR] Bcast %dmin bursts:%d ack:%dms\r\n", PAIRING_TIME_MINS,
              PAIRING_BURST_COUNT, PAIRING_ACK_WAIT_MS);

  bool paired = false;
  uint8_t ack_status = PAIRING_ACK_STATUS_TIMEOUT;

  uint32_t pairing_start_time = millis();
  for (int i = 0; i < PAIRING_BURST_COUNT && !paired; i++) {
    // Check for 1 minute timeout explicitly
    if ((millis() - pairing_start_time) > (PAIRING_TIME_MINS * 60000)) {
      DEBUG_PRINT("[PAIR] Timeout reached after %d mins\r\n",
                  PAIRING_TIME_MINS);
      break;
    }

    // 1. Ensure LED is OFF during TX to save 10mA current load
    GPIO_SetBits(GPIOD, LED_PIN);

    // 2. Send pairing request (Soft-Start + 30ms pre-charge)
    radio_power_up_tx();
    radio_set_tx_addr(PAIRING_ADDR);
    radio_send(packet, 32);

    // 3. Flush RX FIFO + switch to RX to listen for controller ACK
    radio_flush_rx();
    radio_power_up_rx();

    // 4. Visual LED blink during RX listening window
    if ((i % 2) < 1)
      GPIO_ResetBits(GPIOD, LED_PIN); // LED ON during RX
    else
      GPIO_SetBits(GPIOD, LED_PIN);  // LED OFF

    // 5. Wait for ACK from controller
    uint32_t start = millis();
    while ((millis() - start) < PAIRING_ACK_WAIT_MS) {
      if (radio_available()) {
        uint8_t rx_buf[32];
        radio_read(rx_buf, 32);

        DEBUG_PRINT("[PAIR] RX: S=%02X%02X T=%02X\r\n", rx_buf[0], rx_buf[1],
                    rx_buf[2]);

        // Check normal sync: 0xAA 0x55 + type 0x07 (PAIRING_RESP)
        if (rx_buf[0] == 0xAA && rx_buf[1] == 0x55 &&
            rx_buf[2] == PKT_TYPE_PAIRING_RESP) {
          uint16_t resp_id = (uint16_t)rx_buf[4] | ((uint16_t)rx_buf[5] << 8);
          ack_status = rx_buf[11];

          DEBUG_PRINT("[PAIR] NSync RID:0x%04X MY:0x%04X Status=%d Slot=%d\r\n",
                      resp_id, new_id, ack_status, rx_buf[6]);

          if (resp_id == new_id &&
              (ack_status == PAIRING_ACK_STATUS_PAIRED || ack_status == 1)) {
            g_settings.tank_id = new_id;
            g_settings.pairing_status = 1;
            flash_save_settings();
            paired = true;
            DEBUG_PRINT("[PAIR] 🎉 MATCHED! Paired with Slot %d, Stopping "
                        "Pairing Loop.\r\n",
                        rx_buf[6]);
            break;
          }
        }

        // Check bit-inverted sync (NRF phase alignment workaround)
        {
          uint8_t inv[32];
          for (int j = 0; j < 32; j++)
            inv[j] = ~rx_buf[j];

          if (inv[0] == 0xAA && inv[1] == 0x55 &&
              inv[2] == PKT_TYPE_PAIRING_RESP) {
            uint16_t resp_id = (uint16_t)inv[4] | ((uint16_t)inv[5] << 8);
            ack_status = inv[11];

            DEBUG_PRINT(
                "[PAIR] InvSync RID:0x%04X MY:0x%04X Status=%d Slot=%d\r\n",
                resp_id, new_id, ack_status, inv[6]);

            if (resp_id == new_id &&
                (ack_status == PAIRING_ACK_STATUS_PAIRED || ack_status == 1)) {
              g_settings.tank_id = new_id;
              g_settings.pairing_status = 1;
              flash_save_settings();
              paired = true;
              DEBUG_PRINT("[PAIR] 🎉 MATCHED(Inv)! Paired with Slot %d, "
                          "Stopping Pairing Loop.\r\n",
                          inv[6]);
              break;
            }
          }
        }
      }
      Delay_Ms(1);
    }
  }

  GPIO_SetBits(GPIOD, LED_PIN); // LED OFF
  radio_power_down();

  if (paired) {
    // Success feedback: Fast 5x blink
    for (int i = 0; i < 5; i++) {
      GPIO_ResetBits(GPIOD, LED_PIN);
      Delay_Ms(100);
      GPIO_SetBits(GPIOD, LED_PIN);
      Delay_Ms(100);
    }
    DEBUG_PRINT("[PAIR] DONE\r\n");
  } else {
    // Failed: ensure NOT marked as paired
    g_settings.tank_id = 0;
    g_settings.pairing_status = 0;
    flash_save_settings();

    // Failure feedback: Slow 3x blink
    for (int i = 0; i < 3; i++) {
      GPIO_ResetBits(GPIOD, LED_PIN);
      Delay_Ms(500);
      GPIO_SetBits(GPIOD, LED_PIN);
      Delay_Ms(500);
    }
    DEBUG_PRINT("[PAIR] FAIL after %d tries\r\n", PAIRING_BURST_COUNT);
  }
}

/* ========== Main Loop ========== */
int main(void) {
  SystemCoreClockUpdate();
  Delay_Init();
  USART_Printf_Init(115200);

  DEBUG_PRINT("\r\n=== TANK BOOT ===\r\n");
  DEBUG_PRINT("CH32V003 @ %luHz\r\n", (unsigned long)SystemCoreClock);

  timer_init();
  gpio_init();
  adc_init();
  pwr_sleep_init();

  // SAFETY: Delay at boot to allow WCH-Link to connect before MCU sleeps.
  // This is the most reliable way to prevent "Lockout" during development.
  DEBUG_PRINT("[SYS] SafeDelay %dms.. ", BOOT_SAFETY_DELAY_MS);
  Delay_Ms(BOOT_SAFETY_DELAY_MS);
  DEBUG_PRINT("OK\r\n");

  __enable_irq();

  DEBUG_PRINT("Init Radio...\r\n");
  radio_init();
  radio_power_down(); // Start in low power mode

  // Load settings from Flash
  flash_read_settings();

  if (g_settings.pairing_status == 1) {
    DEBUG_PRINT("[SYS] Paired ID:0x%04X\r\n", g_settings.tank_id);
    radio_set_tx_addr(PAIRING_ADDR); // Ensure address is set
  } else {
    DEBUG_PRINT("[SYS] NOT PAIRED. Hold button to pair\r\n");
  }

  // Boot UI: Fast 5x blink (60ms ON, 60ms OFF = 360ms total)
  for (int i = 0; i < 5; i++) {
    GPIO_ResetBits(GPIOD, LED_PIN); // ON
    Delay_Ms(100);
    GPIO_SetBits(GPIOD, LED_PIN); // OFF
    Delay_Ms(100);
  }
  GPIO_SetBits(GPIOD, LED_PIN); // Extra safety: ensure LED is OFF

  DEBUG_PRINT("[SYS] Idle (Hold btn=pair)\r\n");

  reset_runtime_tracking(&g_runtime);

  while (1) {
    // 1. Button Handling
    bool button_pressed = is_button_pressed();
    if (g_button_event_pending || g_runtime.button_press_start != 0 ||
        button_pressed) {
      g_button_event_pending = 0;

      button_action_t button_action = poll_button_action(&g_runtime);
      if (button_action != BUTTON_ACTION_NONE) {
        handle_button_action(&g_runtime, button_action);
        continue;
      }

      if (button_pressed) {
        Delay_Ms(10);
        continue;
      }
    }

    // 2. Data Logic (Only if paired)
    if (g_settings.pairing_status == 1) {
      uint8_t current_level = sample_filtered_level(&g_runtime);
      bool heartbeat_due = (g_runtime.sleep_cycle_count >= HEARTBEAT_CYCLES);

      // Track Level Changes & Wake Attempts (Max 3 Wake-ups per level change)
      if (g_runtime.last_sent_level == 0xFF) {
        // Initial boot state
        g_runtime.pending_level = current_level;
      } else if (current_level != g_runtime.last_sent_level) {
        if (current_level != g_runtime.pending_level) {
          // Brand new water level detected! Reset wake retry counter
          g_runtime.pending_level = current_level;
          g_runtime.wake_retry_count = 0;
        }
      } else {
        // Level is in sync with last confirmed level
        g_runtime.pending_level = current_level;
        g_runtime.wake_retry_count = 0;
      }

      bool level_changed = (current_level != g_runtime.last_sent_level);

      // Decide if send is required
      bool need_send = false;
      if (g_runtime.last_sent_level == 0xFF) {
        need_send = true; // First send on power-on
      } else if (level_changed) {
        if (g_runtime.wake_retry_count < 3) {
          need_send = true; // Within 3 wake attempts
        }
      } else if (heartbeat_due) {
        need_send = true; // 4-hour routine heartbeat
      }

      // Read battery when sending
      if (need_send && (g_runtime.last_sent_level == 0xFF || heartbeat_due ||
                        g_runtime.current_battery == 0)) {
        g_runtime.current_battery = read_battery_level();
        DEBUG_PRINT("[BAT] Battery level: %d%%\r\n", g_runtime.current_battery);
        Delay_Ms(10);
      }

      if (need_send) {
        uint8_t packet[32];
        prepare_data_packet(packet, current_level);

        uint8_t current_try = g_runtime.wake_retry_count + 1;
        DEBUG_PRINT(
            "[TX] %s Seq:%lu L:%d%% (Wake:%d/3) B:%d%% Q:%u%% R:%u F:%d\r\n",
            level_changed ? "CHG" : "HB", (unsigned long)g_runtime.seq_num,
            current_level, current_try, g_runtime.current_battery,
            g_runtime.link_quality, g_runtime.last_rpd_seen, g_probe_fault);

        tx_send_result_t tx_result = send_data_with_retry(&g_runtime, packet);

        if (tx_result == TX_SEND_ABORTED) {
          continue;
        }

        bool ack_received = (tx_result == TX_SEND_ACKED);
        if (ack_received) {
          // Success! Confirmed by controller
          g_runtime.last_sent_level = current_level;
          g_runtime.pending_level = current_level;
          g_runtime.wake_retry_count = 0;
          g_runtime.seq_num++;
        } else {
          // NO ACK after DATA_MAX_RETRIES (15 tries)
          DEBUG_PRINT("[TX] NO ACK on wake attempt %d/3 after %d retries\r\n",
                      current_try, DATA_MAX_RETRIES);
          g_runtime.wake_retry_count++;
          g_runtime.seq_num++;

          if (g_runtime.wake_retry_count >= 3) {
            // Stop sending after 3 wake attempts
            g_runtime.last_sent_level = current_level;
            DEBUG_PRINT("[SYS] 3 wake attempts done without ACK. Level %d%% "
                        "stopped.\r\n",
                        current_level);
          }
        }

        g_runtime.sleep_cycle_count = 0;
      }
    } else {
      DEBUG_PRINT("[SYS] Not paired. Hold button to pair.\r\n");
    }

    // 3. Enter Deep Sleep (Saves battery in both paired and un-paired mode)
    DEBUG_PRINT("[SYS] Sleep\r\n");
    DEBUG_PRINT("----------\r\n");
    enter_deep_sleep();
    g_runtime.sleep_cycle_count++; // Increment cycles on each AWU wake
  }
}
